#+TITLE: posts
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: post
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval never-export

#+OPTIONS: creator:t toc:nil

**** Zip
=zip= is a useful built-in Python function that takes two lists as its arguments
and returns a list where each element is a tuple, and the first element in the
tuple comes from the first list and the second element in the tuple comes from
the second list. For example:
#+BEGIN_SRC python :exports both :results output
a = [1, 2, 3]
b = ['a', 'b', 'c']

print(list(zip(a, b)))
#+END_SRC

#+RESULTS:
: [(1, 'a'), (2, 'b'), (3, 'c')]

In this case, the elements of =a= are /paired up/ with the elements of =b=.
**** List comprehension
List comprehensions in Python are a very handy trick to shorten any =for= loop
in Python. They follow the form of =[... for i in iterable]= where the =...= is
replaced by the code that is run on each element of =iterable= (list, generator,
etc.).

An example of a list comprehension is:
#+BEGIN_SRC python :results output
evens = [i * 2 for i in range(10) if i % 2 == 0]

print(evens)
#+END_SRC

#+RESULTS:
: [0, 4, 8, 12, 16]

This code creates a list of all even numbers between 0 and 10, each of which are
multiplied by 2. Notice how the conditional is placed at the end of the expression.
